app/controllers/subscriptions_controller.rb

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."chef_id" = ? AND "subscriptions"."id" = ? LIMIT ?  [["chef_id", 4], ["id", 1], ["LIMIT", 1]]
---
    def show
		@subscription=current_chef.subscription.find(params[:id])

INSERT INTO "subscriptions" ("created_at", "updated_at", "chef_id", "lunch") VALUES (?, ?, ?, ?)  [["created_at", "2020-03-27 02:56:37.560951"], ["updated_at", "2020-03-27 02:56:37.560951"], ["chef_id", 1], ["lunch", "--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n"]]
---
	def create
		@subscription=current_chef.subscription.new(subscription_params)

		if(@subscription.save)